app/controllers/pages_controller.rb

  def update
    if @page.update_attributes(params[:page])
---
UPDATE `pages` SET `content` = '<div id=\"type-one-r-col-in\">\r\n <div class=\"green-head\" id=\"rslt-head\">\r\n <div class=\"inner\">\r\n <h2>We found <span id=\"rslt-number\"><span><%= @model_data.total_entries %></span></span> storage facilities</h2>\r\n \r\n <form id=\"results_form\" action=\"/storage-locator\" method=\"get\">\r\n <p>\r\n <input type=\"text\" id=\"results\" name=\"q\" class=\"hintable param_filled\" rel=\"q\" title=\"Address or Zip Code\" />\r\n <a href=\"#\" class=\"search-button\">Search</a>\r\n </p>\r\n </form>\r\n </div>\r\n </div>\r\n \r\n <div class=\"clear\"></div>\r\n\r\n <p class=\"rslt-head-txt\">Your <span>nearest</span> self storage is being displayed first</p>\r\n</div>', `updated_at` = '2010-06-22 04:46:53' WHERE `id` = 2